{
  "classes": [
    {
      "name": "CS 46A",
      "desc":
        "Basic skills and concepts of computer programming in an object-oriented approach using Java. Classes, methods and argument passing, control structures, iteration. Basic graphical user interface programming. Problem solving, class discovery and stepwise refinement. Programming and documentation style. Weekly hands-on activity. Prerequisite: Eligibility for Math 019 and a major of Computer Science, Software Engineering, or Undeclared; or instructor consent. Misc/Lab: Lecture 4 hour/lab 3 hours.",
      "id": "cs46a"
    },

    {
      "name": "CS 46B",
      "desc":
        "Stacks and queues, recursion, lists, dynamic arrays, binary search trees. Iteration over collections. Hashing. Searching, elementary sorting. Big-O notation. Standard collection classes. Weekly hands-on activity. Prerequisite: Knowledge of Java equivalent to CS 046A (in Java) or CS 049J (with grade of C or better). Eligibility for MATH 030 or MATH 030P, or instructor consent. Pre/Corequisite: MATH 042. Misc/Lab: 3 hours of lecture/ 3 hours lab",
      "id": "cs46b"
    },

    {
      "name": "CS 146",
      "desc":
        "Implementations of advanced tree structures, priority queues, heaps, directed and undirected graphs. Advanced searching and sorting (radix sort, heapsort, mergesort, and quicksort). Design and analysis of data structures and algorithms. Divide-and-conquer, greedy, and dynamic programming algorithm design techniques. Prerequisite: MATH 030, MATH 042, CS 049J (or equivalent knowledge of Java), and CS 046B (with a grade of \"C-\" or better in each); Computer Science, Applied and Computational Math or Software Engineering Majors only; or instructor consent.",
      "id": "cs146"
    },

    {
      "name": "MATH 123",
      "desc":
        "Matrices, determinants, systems of linear equations, vector geometry, linear transformations, eigenvalues and eigenvectors, diagonalization, first order differential equations, linear systems of differential equations, higher order differential equations, Laplace transforms. Prerequisite: Math 31 (with a grade of \"C-\" or better) or instructor consent.",
      "id": "math123"
    },

    {
      "name": "ENGR 10",
      "desc":
        "Introduction to engineering through hands-on design projects, case studies, and problem-solving using computers. Students also acquire non-technical skills, such as team skills and the ability to deal with ethical dilemmas. GE Area: E Prerequisite: Eligible for MATH 019 and Writing Enrollment Category W-I or W-II, or ENGL 1AF with a grade of CR, or ENGL 1A with a grade of C- or better. Engineering Majors Only Misc/Lab: Lecture 2 hour/lab 3 hours.",
      "id": "engr10"
    },

    {
      "name": "COMM 20",
      "desc":
        "Principles of rhetoric applied to oral communication; selecting, analyzing, adapting, organizing and delivering ideas effectively. GE Area: A1",
      "id": "comm20"
    }
  ]
}